# Define some test functions to test against:
σ_gaussian(x;
    σ0=1.0,
    A=0.5,
    x0=0.3,
    y0=-0.2,
    ℓ=0.2
) = σ0 + A * exp(-((x[1] - x0)^2 + (x[2] - y0)^2) / ℓ^2)

σ_two_gaussians(x;
    σ0=1.0,
    A1=0.4, x1=-0.4, y1=0.3, ℓ1=0.2,
    A2=0.6, x2=0.3, y2=-0.2, ℓ2=0.15
) = σ0 +
    A1 * exp(-((x[1] - x1)^2 + (x[2] - y1)^2) / ℓ1^2) +
    A2 * exp(-((x[1] - x2)^2 + (x[2] - y2)^2) / ℓ2^2)

σ_anisotropic(x;
    σ0=1.0,
    A=0.5,
    ℓx=0.25,
    ℓy=0.1
) = σ0 + A * exp(-(x[1]^2 / ℓx^2 + x[2]^2 / ℓy^2))

σ_polynomial(x;
    σ0=1.0,
    A=0.5
) = σ0 + A * (1 - x[1]^2) * (1 - x[2]^2)

σ_softdisk(x;
    σ0=1.0,
    A=0.8,
    r=0.4,
    ϵ=0.05
) = σ0 + A / (1 + exp((sqrt(x[1]^2 + x[2]^2) - r) / ϵ))
